{
  "name": "Rakesh Nandakum",
  "title": [
    "Software Engineer",
    "Technical Consultant",
    "Full Stack Developer",
    "Freelancer",
    "Lecturer"
  ],
  "profileImage": "/profileImg.png",
  "heroImage": "/hero.jpg",
  "cvLink": "/cv.pdf",
  "shortBio": "With over **3+ years** of hands-on experience in full-stack development, I bring more than just skills, I bring results. I've mastered the art of understanding client needs and architecting precise tech solution on the most in-demand, up-to-date industry best practices and technologies, ensuring scalability for the future. I’ve consistently delivered impactful solutions for government contracts and international clients.",
  "longBio": "I am Rakesh Nandakumar, a software engineer with over 3 years of experience. I began as a freelancer, building web apps, mobile apps, IoT solutions, and cloud-based systems. Later, I joined WebRubix, a Canadian consulting company, where I worked remotely on international projects, expanding my expertise in .NET, React, Node.js, and cloud-first systems while delivering production-ready applications.\n\nI then moved to Procons Infotech, developing enterprise-level solutions for government contracts. My work there involved Laravel, React, Vue, AWS, and React Native, often in high-performance, large-scale environments where security, scalability, and clean architecture were essential.\n\nI don’t limit myself to a single stack—I choose the right tools for the problem. With a deep understanding of technology, I move easily between frameworks. What sets me apart is my ability to combine hands-on coding with big-picture thinking: aligning system design with business goals, long-term growth, and real-world impact. I can switch seamlessly between technical problem solving and architectural strategy, ensuring I deliver not just solutions, but the right solutions. Beyond tech, I excel at communication—translating ideas into scalable software, leading projects end-to-end, and driving initiatives with speed and precision. In short, I don’t just build software—I build trust, confidence, and systems people say are exactly what they needed.",
  "contact": {
    "email": "Rakeshnandakumarr@gmail.com",
    "phone": "+9476-375-5374",
    "address": "704/ Rilaulla kandana",
    "linkedin": "https://linkedin.com/in/rakesh-nandakumar",
    "github": "https://github.com/rakesh-nandakumar/",
    "portfolio": "https://rakeshn.com/",
    "whatsapp": "https://wa.me/94763755374"
  }
}