{
  "name": "Rakesh Nandakumar",
  "title": [
    "Software Engineer",
    "Technical Consultant",
    "Full Stack Developer",
    "Freelancer"
  ],
  "profileImage": "/profileImg.jpg",
  "heroImage": "/hero.jpg",
  "cvLink": "/cv.pdf",
  "shortBio": "With over 3+ years of hands-on experience in full-stack development, I bring more than just skills—I bring results. I've mastered Laravel, React, ASP.NET Core, and cloud technologies, consistently delivering scalable solutions for government clients and international companies.",
  "longBio": "With over 3+ years of hands-on experience in full-stack development, I bring more than just skills, I bring results. I've worked with government clients, international companies, startups, and freelance projects, consistently delivering clean, scalable, and high-performance solutions. I learn incredibly fast and I understand technologies at their core, which means I don't just use tools, I master them.\n\nWhether it's Laravel, React, .NET, or anything in between, transitioning between stacks has never been a challenge for me. I take ownership, solve real problems, and push projects across the finish line. If you're looking for someone who brings confidence, adaptability, and serious capability to the table, I'm the right person.\n\nLet's build something amazing together.",
  "education": [
    {
      "degree": "BSc (Hons) in Computer Science",
      "institution": "Staffordshire University UK",
      "year": "",
      "description": ""
    },
    {
      "degree": "Diploma in Computer Science",
      "institution": "Asia Pacific Institute of Information Technology",
      "year": "",
      "description": ""
    }
  ],
  "experience": [
    {
      "title": "Software Engineer",
      "company": "Procons Infotech",
      "year": "SEPT 2024 - PRESENT",
      "description": "Design and develop various web and Enterprise level software solutions for various government contracts. Developed countless web apps with Laravel, React, jQuery and Bootstrap CSS using agile methods. Built multi-vendor SaaS solutions with EC2 and storage services like S3 using AWS. Collaborated with web, WordPress, and mobile teams for integrated solutions. Implemented back-end systems for various business needs. Created APIs for mobile apps to ensure seamless integration. Consistently delivered clean, efficient, and well-documented code, improving application performance and security through routine code reviews."
    },
    {
      "title": "Full Stack Developer",
      "company": "Webrubix IT Consulting Canada",
      "year": "NOV 2023 - AUG 2024",
      "description": "Designed and developed web solutions for local and foreign clients. Worked on multiple platforms based on ASP.NET core. Worked on a multi vendor application. Developed front-end features using React js, Tailwind, and React Native. Implemented REST APIs and ensured seamless integration with backend services. Maintained version control using Git and collaborated with the team through regular code reviews. Delivered clean, efficient, and well-documented code, enhancing application performance and security."
    },
    {
      "title": "Technical Consultant",
      "company": "Freelance",
      "year": "FEB 2023 - PRESENT",
      "description": "Full Stack Web Application Development, Enterprise Level System Development, Full Stack Mobile App Development (React Native), Chrome Extensions Development, IOT solutions (eg arduino)."
    }
  ],
  "techStack": [
    {
      "name": "Laravel",
      "icon": "/tech-icons/laravel.svg",
      "description": "Strong expertise in building scalable backends and APIs with Laravel, using features like authentication, middleware, and Eloquent ORM."
    },
    {
      "name": "Next.js",
      "icon": "/tech-icons/nextjs.svg",
      "darkMode": true,
      "description": "Expert in full-stack development with Next.js, leveraging SSR, static generation, and API routes for high-performance apps."
    },
    {
      "name": "ASP.NET",
      "icon": "/tech-icons/aspnet.svg",
      "description": "Strong experience in developing secure, scalable enterprise apps with ASP.NET and integrating cloud-based services."
    },
    {
      "name": "WordPress",
      "icon": "/tech-icons/wordpress.svg",
      "description": "Expert in WordPress development, including custom themes, plugins, WooCommerce, and performance optimization."
    },
    {
      "name": "React Native",
      "icon": "/tech-icons/react-native.svg",
      "description": "Expert in building cross-platform mobile apps with React Native, ensuring smooth performance on iOS and Android."
    },
    {
      "name": "AWS",
      "icon": "/tech-icons/aws.svg",
      "darkMode": true,
      "description": "Extensive experience deploying and managing cloud solutions using AWS services like EC2, S3, RDS, Lambda, and IAM."
    },
    {
      "name": "JavaScript Frameworks",
      "icon": "/tech-icons/javascript.svg",
      "description": "Strong proficiency in Vue.js, Alpine.js, and jQuery for building dynamic, responsive front-end components."
    },
    {
      "name": "Raspberry Pi",
      "icon": "/tech-icons/raspberry-pi.svg",
      "description": "Hands-on experience using Raspberry Pi for IoT, automation, and educational projects with hardware integration."
    },
    {
      "name": "ChatGPT",
      "icon": "/tech-icons/chatgpt.svg",
      "darkMode": true,
      "description": "Strong experience integrating ChatGPT for chatbots, AI-powered analytics, content generation, and support automation."
    }
  ],
  "timeline": [
    {
      "time": "September 2024 - Present",
      "active": true,
      "title": "Software Engineer at Procons Infotech",
      "description": "Designing and developing web and Enterprise level software solutions for government contracts using Laravel, React, jQuery, Bootstrap, and AWS services",
      "category": "work",
      "technologies": [
        "Laravel",
        "React",
        "jQuery",
        "Bootstrap",
        "AWS",
        "EC2",
        "S3"
      ],
      "achievements": [
        "Developed countless web apps using agile methods",
        "Built multi-vendor SaaS solutions with AWS",
        "Collaborated with web, WordPress, and mobile teams",
        "Implemented back-end systems for various business needs",
        "Created APIs for mobile apps"
      ],
      "links": []
    },
    {
      "time": "November 2023 - August 2024",
      "title": "Full Stack Developer at Webrubix IT Consulting Canada",
      "description": "Designed and developed web solutions for local and foreign clients using ASP.NET Core, React.js, Tailwind, and React Native",
      "category": "work",
      "technologies": [
        "ASP.NET Core",
        "React.js",
        "Tailwind CSS",
        "React Native",
        "Git"
      ],
      "achievements": [
        "Worked on multiple platforms based on ASP.NET core",
        "Worked on a multi vendor application",
        "Developed front-end features using React js, Tailwind, and React Native",
        "Implemented REST APIs and ensured seamless integration",
        "Delivered clean, efficient, and well-documented code"
      ],
      "links": []
    },
    {
      "time": "February 2023 - Present",
      "active": true,
      "title": "Technical Consultant (Freelance)",
      "description": "Providing consulting services for full-stack web applications, enterprise systems, mobile apps, Chrome extensions, and IoT solutions",
      "category": "freelance",
      "technologies": [
        "Full Stack Web Development",
        "React Native",
        "Chrome Extensions",
        "IoT Solutions",
        "Arduino"
      ],
      "achievements": [
        "Enterprise Level System Development",
        "Full Stack Mobile App Development",
        "Chrome Extensions Development",
        "IOT solutions development"
      ],
      "links": []
    },
    {
      "time": "",
      "title": "Diploma in Computer Science",
      "description": "Diploma from Asia Pacific Institute of Information Technology",
      "category": "education",
      "technologies": [],
      "achievements": [],
      "links": []
    },
    {
      "time": "",
      "title": "BSc (Hons) in Computer Science",
      "description": "Degree from Staffordshire University UK",
      "category": "education",
      "technologies": [],
      "achievements": [],
      "links": []
    }
  ],
  "contact": {
    "email": "Rakeshnandakumarr@gmail.com",
    "phone": "+9476-375-5374",
    "address": "704/ Rilaulla kandana",
    "linkedin": "https://linkedin.com/in/rakesh-nandakumar",
    "github": "https://github.com/rakesh-nandakumar/",
    "portfolio": "https://rakeshn.com/"
  }
}
