[
  {
    "image": "/projects/apiit.png",
    "category": "Development",
    "title": "APIIT University Blog",
    "shortDescription": "A comprehensive student blog platform built for APIIT University to foster engagement and collaboration",
    "longDescription": "Developed an enterprise-level platform for APIIT University featuring personalized experiences based on student affiliations, multi-admin role panels, interactive blog system, event calendar with real-time notifications, appointment booking system, alumni hub for networking, and advanced search functionality. Implemented robust security through middlewares, gates, and policies with email verification and role-based access. Enhanced with SEO optimization to ensure platform discoverability and accessibility.",
    "technologies": [
      "Laravel",
      "LiveWire",
      "FilamentPHP",
      "Tailwind CSS",
      "AlpineJS",
      "AWS",
      "Docker",
      "SEO"
    ],
    "githubLink": "https://github.com/example/apiit-university-blog",
    "featured": true,
    "status": "completed",
    "type": "work"
  },
  {
    "image": "/projects/csc.png",
    "category": "Development",
    "title": "Ceylon Sports Club Canada",
    "shortDescription": "Enterprise-level web solution for a not-for-profit social club connecting Sri Lankan cricket enthusiasts in Canada",
    "longDescription": "Developed a comprehensive platform for Ceylon Sports Club featuring sports & team management, membership systems, event booking with calendar integration, document management with version control, and a blog for club updates. Implemented robust security through middlewares, gates, and policies, with background jobs and queues for efficient email notifications and form processing. The platform serves the growing Sri Lankan cricket community in Canada with SEO optimizations for enhanced visibility.",
    "technologies": ["Next.js", "React", "Bootstrap", "MongoDB", "AWS", "SEO"],
    "githubLink": "https://github.com/example/ceylon-sports-club",
    "featured": true,
    "status": "completed",
    "type": "work"
  },
  {
    "image": "/projects/pm.png",
    "category": "Development",
    "title": "Next-Gen Project Mgmt Tool",
    "shortDescription": "Advanced project management platform with Gemini AI integration for intelligent task automation and insights",
    "longDescription": "Engineered a cutting-edge project management solution that leverages Gemini AI to provide intelligent workflow suggestions, automate routine tasks, and deliver data-driven insights. The platform features real-time collaboration, customizable dashboards, resource allocation optimization, and predictive analytics for project timelines. Built with a robust ASP.NET backend and responsive React frontend with Redux state management for optimal performance and scalability.",
    "technologies": ["ASP.NET", "React", "Redux", "Gemini AI", "SQL Server"],
    "githubLink": "https://github.com/example/next-gen-pm",
    "featured": true,
    "status": "completed",
    "type": "feelance"
  },
  {
    "image": "/projects/justlistenit.png",
    "category": "Development",
    "title": "JustListenIt Chrome Extension",
    "shortDescription": "A Chrome extension that reads selected text on any web page out loud for improved accessibility and productivity",
    "longDescription": "Developed JustListenIt, a lightweight yet powerful Chrome extension that allows users to select any text on a webpage and have it read aloud instantly. Built using JavaScript, Chrome Extension APIs, and the Web Speech API for natural-sounding speech synthesis. Includes features like language detection, customizable voices, and playback speed adjustment. Ideal for users with accessibility needs or those who prefer auditory content consumption.",
    "technologies": [
      "JavaScript",
      "Chrome Extensions API",
      "Web Speech API",
      "HTML",
      "CSS"
    ],
    "featured": false,
    "status": "completed",
    "type": "personal"
  },
  {
    "image": "/projects/sql-script-shaper.png",
    "category": "Development Tools",
    "title": "SQL Script Shaper",
    "shortDescription": "A modern web application that converts CSV and Excel files into ready-to-use SQL INSERT statements with customizable options",
    "longDescription": "Developed a streamlined web tool that transforms spreadsheet data into SQL database scripts instantly. The application features drag-and-drop file upload supporting both CSV and Excel formats, real-time data preview with validation, customizable SQL generation options including table naming, DROP TABLE statements, and string wrapping preferences. Built with a modern React interface using ShadCN UI components, particle background animations, and toast notifications for enhanced user experience. Includes intelligent data type detection, automatic table name generation from filenames, and comprehensive error handling for robust file processing.",
    "technologies": [
      "React",
      "TypeScript",
      "Vite",
      "ShadCN UI",
      "Tailwind CSS",
      "XLSX",
      "React Query",
      "Lucide Icons"
    ],
    "liveLink": "https://sql-script-shaper.rakeshn.com/",
    "featured": true,
    "status": "completed",
    "type": "personal"
  },
  {
    "image": "/projects/apilite.png",
    "category": "Development Tools",
    "title": "APILite",
    "shortDescription": "A sleek and powerful Postman-lite API request builder with modern UI and enhanced request/response workflows.",
    "longDescription": "Designed and built a lightweight yet feature-rich API testing tool that streamlines the process of crafting, sending, and inspecting HTTP requests. APILite features method toggles, header and query param editors, raw/form/x-www support, and a dynamic response viewer with syntax highlighting. Requests can be saved, organized, and re-executed via a built-in history manager. The application focuses heavily on user experience with dark-mode UI, intuitive animations, local storage persistence, and real-time validation feedback. Ideal for developers looking for a fast, clean, browser-based alternative to Postman.",
    "technologies": [
      "React",
      "TypeScript",
      "Vite",
      "ShadCN UI",
      "Tailwind CSS",
      "React Query",
      "Lucide Icons",
      "Prism.js"
    ],
    "liveLink": "https://apilite.rakeshn.com/",
    "featured": true,
    "status": "completed",
    "type": "personal"
  },
  {
  "image": "/projects/ai-resume-matcher.png",
  "category": "AI Tools",
  "title": "AI Resume Matcher",
  "shortDescription": "A smart resume analysis tool that ranks CVs based on job descriptions using Gemini AI with built-in ZIP parsing and real-time scoring.",
  "longDescription": "AI Resume Matcher is an intelligent frontend-only tool that allows users to upload a ZIP file of CVs (PDF/DOCX/TXT) and input a job description. The application parses the resumes, compares them to the job requirements using Gemini API, and generates a match score with reasoning for each candidate. It features light/dark theme toggle, file validation, Supabase authentication, usage limits for free users, and a beautiful UI built with ShadCN components. Designed for quick assessments and ranking of candidates without a backend, this tool is ideal for HR professionals, recruiters, and startups.",
  "technologies": [
    "React",
    "TypeScript",
    "Vite",
    "ShadCN UI",
    "Tailwind CSS",
    "JSZip",
    "pdfjs-dist",
    "@google/generative-ai",
    "Supabase Auth"
  ],
  "liveLink": "https://ai-resume-matcher.rakeshn.com/",
  "featured": true,
      "status": "ongoing",
    "progress": 90,
  "type": "personal"
}
]
