[
  {
    "image": "/projects/apiit.png",
    "category": "Development",
    "title": "APIIT University Blog",
    "shortDescription": "A comprehensive student blog platform built for APIIT University to foster engagement and collaboration",
    "longDescription": "Developed an enterprise-level platform for APIIT University featuring personalized experiences based on student affiliations, multi-admin role panels, interactive blog system, event calendar with real-time notifications, appointment booking system, alumni hub for networking, and advanced search functionality. Implemented robust security through middlewares, gates, and policies with email verification and role-based access. Enhanced with SEO optimization to ensure platform discoverability and accessibility.",
    "technologies": [
      "Laravel",
      "LiveWire",
      "FilamentPHP",
      "Tailwind CSS",
      "AlpineJS",
      "AWS",
      "Docker",
      "SEO"
    ],
    "liveLink": "https://example.com/apiit-university-blog",
    "githubLink": "https://github.com/example/apiit-university-blog",
    "featured": true,
    "status": "completed",
    "type": "work"
  },
  {
    "image": "/projects/csc.png",
    "category": "Development",
    "title": "Ceylon Sports Club Canada",
    "shortDescription": "Enterprise-level web solution for a not-for-profit social club connecting Sri Lankan cricket enthusiasts in Canada",
    "longDescription": "Developed a comprehensive platform for Ceylon Sports Club featuring sports & team management, membership systems, event booking with calendar integration, document management with version control, and a blog for club updates. Implemented robust security through middlewares, gates, and policies, with background jobs and queues for efficient email notifications and form processing. The platform serves the growing Sri Lankan cricket community in Canada with SEO optimizations for enhanced visibility.",
    "technologies": ["Next.js", "React", "Bootstrap", "MongoDB", "AWS", "SEO"],
    "liveLink": "https://example.com/ceylon-sports-club",
    "githubLink": "https://github.com/example/ceylon-sports-club",
    "featured": true,
    "status": "ongoing",
    "progress": 75,
    "type": "freelance",
    "price": "$20"
  },
  {
    "image": "/projects/pm.png",
    "category": "Development",
    "title": "Next-Gen Project Mgmt Tool",
    "shortDescription": "Advanced project management platform with Gemini AI integration for intelligent task automation and insights",
    "longDescription": "Engineered a cutting-edge project management solution that leverages Gemini AI to provide intelligent workflow suggestions, automate routine tasks, and deliver data-driven insights. The platform features real-time collaboration, customizable dashboards, resource allocation optimization, and predictive analytics for project timelines. Built with a robust ASP.NET backend and responsive React frontend with Redux state management for optimal performance and scalability.",
    "technologies": ["ASP.NET", "React", "Redux", "Gemini AI", "SQL Server"],
    "liveLink": "https://example.com/next-gen-pm",
    "githubLink": "https://github.com/example/next-gen-pm",
    "featured": true,
    "status": "upcoming",
    "type": "work"
  },
  {
    "image": "/projects/justlistenit.png",
    "category": "Development",
    "title": "JustListenIt Chrome Extension",
    "shortDescription": "A Chrome extension that reads selected text on any web page out loud for improved accessibility and productivity",
    "longDescription": "Developed JustListenIt, a lightweight yet powerful Chrome extension that allows users to select any text on a webpage and have it read aloud instantly. Built using JavaScript, Chrome Extension APIs, and the Web Speech API for natural-sounding speech synthesis. Includes features like language detection, customizable voices, and playback speed adjustment. Ideal for users with accessibility needs or those who prefer auditory content consumption.",
    "technologies": [
      "JavaScript",
      "Chrome Extensions API",
      "Web Speech API",
      "HTML",
      "CSS"
    ],
    "liveLink": "https://example.com/justlistenit",
    "githubLink": "https://github.com/example/justlistenit",
    "featured": false,
    "status": "ongoing",
    "progress": 45,
    "type": "personal"
  },
  {
    "image": "/projects/warehouse-alert.png",
    "category": "IoT",
    "title": "IoT Warehouse Temp Alert System",
    "shortDescription": "An IoT system that triggers a buzzer alarm when warehouse temperature exceeds a defined threshold",
    "longDescription": "Designed and implemented a low-cost IoT solution using Arduino to monitor warehouse temperature. The system utilizes a DHT11 temperature sensor to constantly read the environment, and activates a buzzer if the temperature exceeds a configurable safety limit. Ideal for environments where real-time overheating alerts are critical to protect goods or equipment. Built using basic components such as Arduino Uno, breadboard, buzzer, and jumper wires, powered via USB.",
    "technologies": [
      "Arduino",
      "C++",
      "DHT11 Sensor",
      "IoT",
      "Embedded Systems"
    ],
    "liveLink": "https://example.com/warehouse-temp-alert",
    "githubLink": "https://github.com/example/warehouse-temp-alert",
    "featured": true,
    "status": "completed",
    "type": "personal"
  },
  {
    "image": "/projects/apiit.png",
    "category": "Mobile Development",
    "title": "E-Commerce Mobile App",
    "shortDescription": "A comprehensive mobile e-commerce application with real-time inventory and payment integration",
    "longDescription": "Building a full-featured mobile e-commerce app using React Native with real-time inventory management, secure payment processing, user authentication, shopping cart functionality, and push notifications. Integrating with Firebase for backend services and Stripe for payment processing.",
    "technologies": [
      "React Native",
      "Firebase",
      "Stripe",
      "Redux",
      "TypeScript"
    ],
    "liveLink": "https://example.com/ecommerce-app",
    "githubLink": "https://github.com/example/ecommerce-app",
    "featured": false,
    "status": "ongoing",
    "progress": 30,
    "type": "personal"
  },
  {
    "image": "/projects/csc.png",
    "category": "AI/ML",
    "title": "AI Content Generator Platform",
    "shortDescription": "An AI-powered platform for generating marketing content using GPT-4 and image generation APIs",
    "longDescription": "Developing an intelligent content creation platform that leverages GPT-4 for text generation and DALL-E for image creation. Features include template management, brand voice customization, content scheduling, and analytics dashboard. Built with Next.js and integrated with OpenAI APIs.",
    "technologies": [
      "Next.js",
      "OpenAI API",
      "PostgreSQL",
      "Prisma",
      "Tailwind CSS"
    ],
    "liveLink": "https://example.com/ai-content-generator",
    "githubLink": "https://github.com/example/ai-content-generator",
    "featured": false,
    "status": "ongoing",
    "progress": 65,
    "type": "freelance"
  },
  {
    "image": "/projects/pm.png",
    "category": "Web Development",
    "title": "Social Media Analytics Dashboard",
    "shortDescription": "Real-time social media analytics dashboard with advanced reporting and competitor analysis",
    "longDescription": "Creating a comprehensive social media analytics platform that aggregates data from multiple social platforms, provides real-time insights, competitor analysis, and automated reporting. Features include custom dashboards, scheduled reports, and team collaboration tools.",
    "technologies": ["Vue.js", "Node.js", "MongoDB", "D3.js", "Socket.io"],
    "liveLink": "https://example.com/social-analytics",
    "githubLink": "https://github.com/example/social-analytics",
    "featured": false,
    "status": "ongoing",
    "progress": 85,
    "type": "work"
  },
  {
    "image": "/projects/justlistenit.png",
    "category": "Blockchain",
    "title": "NFT Marketplace Platform",
    "shortDescription": "Decentralized NFT marketplace with smart contracts and cryptocurrency payment integration",
    "longDescription": "Building a decentralized NFT marketplace on Ethereum blockchain with smart contract integration, crypto wallet connectivity, auction functionality, and royalty management. Features include user profiles, collection management, and integrated payment processing.",
    "technologies": ["React", "Solidity", "Web3.js", "Ethereum", "IPFS"],
    "liveLink": "https://example.com/nft-marketplace",
    "githubLink": "https://github.com/example/nft-marketplace",
    "featured": false,
    "status": "ongoing",
    "progress": 15,
    "type": "personal"
  },
  {
    "image": "/projects/warehouse-alert.png",
    "category": "DevOps",
    "title": "Cloud Infrastructure Automation",
    "shortDescription": "Automated cloud infrastructure deployment and management system using Terraform and Kubernetes",
    "longDescription": "Developing a comprehensive cloud infrastructure automation platform that handles deployment, scaling, monitoring, and management of applications across multiple cloud providers. Includes CI/CD pipeline integration, cost optimization, and security compliance monitoring.",
    "technologies": ["Terraform", "Kubernetes", "Docker", "AWS", "Jenkins"],
    "liveLink": "https://example.com/cloud-automation",
    "githubLink": "https://github.com/example/cloud-automation",
    "featured": false,
    "status": "ongoing",
    "progress": 92,
    "type": "work"
  }
]
