{
  "category": {
    "Work Experience": 1,
    "Education": 2
  },
  "timeline": [{
    "category": 1,
    "time": "Sept 2024 - Present",
    "title": "Software Engineer at Procons Infotech",
    "short-description": "Building enterprise-grade software for government contracts with a focus on high scalability, security, and performance using Laravel, React, Vue, and AWS.",
    "long-description": "Building enterprise-level systems for government contracts, working on large-scale, mission-critical applications where security, scalability, and reliability are non-negotiable. Developed multi-vendor SaaS platforms, complex APIs, and web solutions using Laravel, React, Vue, and AWS. Designed and optimized back-end architectures, integrated cross-platform solutions, and contributed to government-grade systems that require clean architecture, performance tuning, and rigorous security standards.",

    "technologies": [
      "Laravel",
      "React",
      "Vue",
      "AWS",
      "EC2",
      "S3",
      "React Native"
    ],

    "links": [
      { "portfolio": "https://proconsinfotech.com/" },
      { "linkedin": "https://www.linkedin.com/company/procons-infotech/" }
    ]
  },
  {
    "category": 1,
    "time": "Nov 2023 - Aug 2024",
    "title": "Full Stack Developer at Webrubix IT Consulting (Canada)",
    "short-description": "Worked on international projects for Canadian clients, delivering scalable, production-ready applications using ASP.NET Core, React, Node.js, and cloud-first designs.",
    "long-description": "Delivered international projects for Canadian clients in a full-time remote role. Designed and built applications using ASP.NET Core, React, Node.js, and cloud-first architectures. Worked on multi-vendor systems, implemented modern front-end features with React + Tailwind, and built secure REST APIs. Ensured seamless integration across stacks, collaborated with international teams, and consistently delivered polished, production-ready software tailored for global clients.",

    "technologies": [
      "ASP.NET Core",
      "React.js",
      "Tailwind CSS",
      "Node.js",
      "React Native",
      "Git"
    ]
  },
  {
    "category": 1,
    "time": "Feb 2023 - Present",
    "title": "Technical Consultant (Freelance)",
    "short-description": "Provided end-to-end consulting for web, mobile, and IoT projects, working directly with clients to design, build, and deploy complete software solutions.",
    "long-description": "Started my career as a freelancer, where I delivered full-stack web and mobile applications, Chrome extensions, IoT and hardware-based solutions, and even machine learning projects. This role gave me direct client-facing experience, teaching me how to translate ideas into real solutions while managing end-to-end delivery—from requirement gathering and solution design to deployment and long-term support. Built a strong reputation for adaptability, problem-solving, and creating impactful solutions for both local and international clients.",
    "technologies": [
      "Laravel",
      "React",
      "React Native",
      "IoT (Arduino, Raspberry Pi)",
      "Chrome Extensions",
      "Machine Learning",
      "AWS"
    ]
  },
  {
    "category": 2,
    "title": "Diploma in Computer Science",
    "short-description": "Diploma from Asia Pacific Institute of Information Technology",
    "long-description": "GPA: 3.5 / 4.0 (Computer Science)",
    "status": "Completed"
  },
  {
    "category": 2,
    "title": "BSc (Hons) in Computer Science",
    "short-description": "Degree from Staffordshire University UK",
    "status": "Completed"
  }
  ]
}
